/*Задача 15: Напишите программу, которая принимает 
на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет*/

Console.Clear();

string[] week = { "понеельник", "вторник", "среда", "четверг", "пятница", "суббота", "восресение" };

Console.WriteLine("Введите номер дня недели");
int num = int.Parse(Console.ReadLine());

if (num > 7)
{
    Console.WriteLine("Сколько по твоему дней в неделе?");
}
else if (num > 5)
{
    Console.WriteLine($"Ура, сегодня {week[num - 1]}, выходной!");
}
else
{
    Console.WriteLine($"Сегодня {week[num - 1]}, работай, солнце еще высоко");
}
