/* 
Задача 4: Напишите программу, которая принимает на вход 
три числа и выдает максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
*/

// Думал решить с помощью массива но это пока фантазии. Так что не обращайте внимания:)

Console.Clear();

Console.WriteLine("Введи числа ");
int n = Convert.ToInt32(Console.ReadLine());
int[] nums = new int[n];

Console.Write(nums);


for (int i = 1; i < n; i++)
{

}

// while (i < n)
// {
    // Console.WriteLine($"Введите {i + 1} число");
    // int el = nums.Take(el)Convert.ToInt32(Console.ReadLine());


    // Console.Write($"{nums[i]}");
    // i++;
// } 